app/Http/Controllers/ProjectController.php

    public function index(Request $request): View
        {
            $search = $request->input('search');

            // Jika ada kata kunci pencarian, filter berdasarkan nama atau deskripsi
            $project = Project::query()
                ->when($search, function ($query, $search) {
                    return $query->where('pro_title', 'like', "%{$search}%")
                                ->orWhere('pro_category', 'like', "%{$search}%");
                })
                ->latest()
                ->simplePaginate(10);
---
select * from `projects` order by `created_at` desc limit 11 offset 0

        public function pageProject() : View
        {
            $project = Project::with('techstack')->get();
---
select * from `projects`