app/Http/Controllers/TechstackController.php

select * from `techstacks` order by `created_at` desc limit 11 offset 0
---
    public function index(Request $request): View
        {
            $search = $request->input('search');

            // Jika ada kata kunci pencarian, filter berdasarkan nama atau deskripsi
            $techstack = Techstack::query()
                ->when($search, function ($query, $search) {
                    return $query->where('tech_name', 'like', "%{$search}%")
                                ->orWhere('tech_description', 'like', "%{$search}%");
                })
                ->latest()
                ->simplePaginate(10);

select * from `techstacks`
---
        public function pageTechstack()

        {

            $techstack = Techstack::all();